; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-16)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p0-2 - location
	p0-5 - location
	p0-9 - location
	p1-2 - location
	p1-3 - location
	p1-4 - location
	p1-6 - location
	p2-7 - location
	p2-8 - location
	p3-2 - location
	p6-0 - location
	p6-2 - location
	p7-3 - location
	p9-2 - location
	p9-5 - location
	p9-6 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s8)
	(at driver3 s9)
	(at driver4 s5)
	(at driver5 s3)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s8)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s8)
	(empty truck5)
	(at package1 s2)
	(at package2 s4)
	(at package3 s8)
	(at package4 s7)
	(at package5 s6)
	(at package6 s6)
	(at package7 s8)
	(at package8 s5)
	(at package9 s9)
	(at package10 s3)
	(at package11 s3)
	(at package12 s8)
	(at package13 s3)
	(at package14 s0)
	(at package15 s4)
	(at package16 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(link s0 s2)
	(link s2 s0)
	(link s0 s6)
	(link s6 s0)
	(link s0 s9)
	(link s9 s0)
	(link s1 s4)
	(link s4 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s8)
	(link s8 s2)
	(link s3 s6)
	(link s6 s3)
	(link s3 s8)
	(link s8 s3)
	(link s3 s9)
	(link s9 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s4)
	(link s4 s5)
	(link s6 s1)
	(link s1 s6)
	(link s6 s2)
	(link s2 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s2)
	(link s2 s7)
	(link s7 s8)
	(link s8 s7)
	(link s8 s9)
	(link s9 s8)
	(link s9 s1)
	(link s1 s9)
	(link s9 s5)
	(link s5 s9)
	(link s9 s7)
	(link s7 s9)
)
	(:goal (and
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s6)
	(at driver5 s8)
	(at truck2 s0)
	(at truck3 s6)
	(at truck4 s5)
	(at truck5 s4)
	(at package1 s6)
	(at package2 s4)
	(at package3 s4)
	(at package4 s9)
	(at package5 s2)
	(at package6 s8)
	(at package7 s7)
	(at package9 s3)
	(at package10 s1)
	(at package11 s3)
	(at package12 s8)
	(at package13 s6)
	(at package14 s4)
	(at package15 s1)
	(at package16 s8)
	))


)

; plan
1. (board-truck driver4 s5 truck1)
   deleted: (at driver4 s5) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 23
2. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 3 of 23
3. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 3 of 23
4. (board-truck driver1 s1 truck3)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 23
5. (drive-truck driver1 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 3 of 23
6. (drive-truck driver1 s2 s6 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   goals met: 4 of 23
7. (board-truck driver2 s8 truck2)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 23
8. (drive-truck driver4 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 4 of 23
9. (load-truck s4 package15 truck1)
   deleted: (at package15 s4)
   added: (in package15 truck1)
   goals met: 4 of 23
10. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 4 of 23
11. (unload-truck s1 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s1)
   goals met: 5 of 23
12. (load-truck s8 package7 truck2)
   deleted: (at package7 s8)
   added: (in package7 truck2)
   goals met: 5 of 23
13. (drive-truck driver2 s8 s2 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s2)
   goals met: 5 of 23
14. (load-truck s2 package1 truck2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 5 of 23
15. (load-truck s6 package6 truck3)
   deleted: (at package6 s6)
   added: (in package6 truck3)
   goals met: 5 of 23
16. (load-truck s6 package5 truck3)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   goals met: 5 of 23
17. (drive-truck driver1 s6 s3 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   goals met: 4 of 23
18. (drive-truck driver4 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 4 of 23
19. (load-truck s6 package16 truck1)
   deleted: (at package16 s6)
   added: (in package16 truck1)
   goals met: 4 of 23
20. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 5 of 23
21. (drive-truck driver1 s3 s8 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   goals met: 5 of 23
22. (drive-truck driver4 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 5 of 23
23. (load-truck s3 package13 truck1)
   deleted: (at package13 s3)
   added: (in package13 truck1)
   goals met: 5 of 23
24. (load-truck s3 package10 truck1)
   deleted: (at package10 s3)
   added: (in package10 truck1)
   goals met: 5 of 23
25. (drive-truck driver4 s3 s6 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 5 of 23
26. (unload-truck s6 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s6)
   goals met: 6 of 23
27. (load-truck s0 package14 truck2)
   deleted: (at package14 s0)
   added: (in package14 truck2)
   goals met: 6 of 23
28. (unload-truck s8 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s8)
   goals met: 7 of 23
29. (load-truck s8 package3 truck3)
   deleted: (at package3 s8)
   added: (in package3 truck3)
   goals met: 7 of 23
30. (drive-truck driver1 s8 s2 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   goals met: 7 of 23
31. (unload-truck s2 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s2)
   goals met: 8 of 23
32. (drive-truck driver1 s2 s7 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   goals met: 8 of 23
33. (load-truck s7 package4 truck3)
   deleted: (at package4 s7)
   added: (in package4 truck3)
   goals met: 8 of 23
34. (drive-truck driver1 s7 s9 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   goals met: 8 of 23
35. (load-truck s9 package9 truck3)
   deleted: (at package9 s9)
   added: (in package9 truck3)
   goals met: 8 of 23
36. (unload-truck s9 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s9)
   goals met: 9 of 23
37. (drive-truck driver1 s9 s3 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s3)
   goals met: 9 of 23
38. (unload-truck s3 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s3)
   goals met: 10 of 23
39. (drive-truck driver1 s3 s6 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   goals met: 11 of 23
40. (walk driver3 s9 p9-6)
   deleted: (at driver3 s9)
   added: (at driver3 p9-6)
   goals met: 11 of 23
41. (walk driver3 p9-6 s6)
   deleted: (at driver3 p9-6)
   added: (at driver3 s6)
   goals met: 11 of 23
42. (walk driver3 s6 p1-6)
   deleted: (at driver3 s6)
   added: (at driver3 p1-6)
   goals met: 11 of 23
43. (walk driver3 p1-6 s1)
   deleted: (at driver3 p1-6)
   added: (at driver3 s1)
   goals met: 12 of 23
44. (walk driver5 s3 p3-2)
   deleted: (at driver5 s3)
   added: (at driver5 p3-2)
   goals met: 12 of 23
45. (walk driver5 p3-2 s2)
   deleted: (at driver5 p3-2)
   added: (at driver5 s2)
   goals met: 12 of 23
46. (walk driver5 s2 p2-8)
   deleted: (at driver5 s2)
   added: (at driver5 p2-8)
   goals met: 12 of 23
47. (walk driver5 p2-8 s8)
   deleted: (at driver5 p2-8)
   added: (at driver5 s8)
   goals met: 13 of 23
48. (drive-truck driver1 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 12 of 23
49. (drive-truck driver1 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 12 of 23
50. (unload-truck s4 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   goals met: 13 of 23
51. (drive-truck driver1 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 13 of 23
52. (drive-truck driver1 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 14 of 23
53. (drive-truck driver4 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 14 of 23
54. (unload-truck s1 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 15 of 23
55. (drive-truck driver4 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 15 of 23
56. (drive-truck driver2 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 14 of 23
57. (unload-truck s4 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s4)
   goals met: 15 of 23
58. (drive-truck driver2 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 16 of 23
59. (board-truck driver5 s8 truck5)
   deleted: (at driver5 s8) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 15 of 23
60. (drive-truck driver5 s8 s7 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s7)
   goals met: 15 of 23
61. (drive-truck driver5 s7 s4 truck5)
   deleted: (at truck5 s7)
   added: (at truck5 s4)
   goals met: 16 of 23
62. (drive-truck driver4 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 16 of 23
63. (drive-truck driver4 s3 s8 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   goals met: 16 of 23
64. (unload-truck s8 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s8)
   goals met: 17 of 23
65. (drive-truck driver4 s8 s3 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   goals met: 17 of 23
66. (drive-truck driver4 s3 s6 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 17 of 23
67. (disembark-truck driver5 s4 truck5)
   deleted: (driving driver5 truck5)
   added: (at driver5 s4) (empty truck5)
   goals met: 17 of 23
68. (board-truck driver5 s4 truck4)
   deleted: (at driver5 s4) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 17 of 23
69. (drive-truck driver5 s4 s5 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   goals met: 18 of 23
70. (drive-truck driver2 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 17 of 23
71. (drive-truck driver2 s6 s2 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   goals met: 17 of 23
72. (drive-truck driver2 s2 s7 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s7)
   goals met: 17 of 23
73. (unload-truck s7 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s7)
   goals met: 18 of 23
74. (drive-truck driver2 s7 s9 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s9)
   goals met: 18 of 23
75. (drive-truck driver2 s9 s5 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s5)
   goals met: 18 of 23
76. (disembark-truck driver2 s5 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 18 of 23
77. (walk driver2 s5 p0-5)
   deleted: (at driver2 s5)
   added: (at driver2 p0-5)
   goals met: 18 of 23
78. (unload-truck s5 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s5)
   goals met: 18 of 23
79. (walk driver2 p0-5 s0)
   deleted: (at driver2 p0-5)
   added: (at driver2 s0)
   goals met: 19 of 23
80. (drive-truck driver5 s5 s9 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s9)
   goals met: 18 of 23
81. (drive-truck driver5 s9 s8 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   goals met: 18 of 23
82. (drive-truck driver4 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 18 of 23
83. (load-truck s5 package1 truck1)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 18 of 23
84. (disembark-truck driver4 s5 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s5) (empty truck1)
   goals met: 18 of 23
85. (board-truck driver4 s5 truck2)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 18 of 23
86. (unload-truck s5 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   goals met: 18 of 23
87. (drive-truck driver4 s5 s6 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   goals met: 18 of 23
88. (drive-truck driver5 s8 s9 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s9)
   goals met: 18 of 23
89. (drive-truck driver4 s6 s5 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   goals met: 18 of 23
90. (drive-truck driver5 s9 s5 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s5)
   goals met: 19 of 23
91. (drive-truck driver4 s5 s9 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s9)
   goals met: 19 of 23
92. (disembark-truck driver4 s9 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s9) (empty truck2)
   goals met: 19 of 23
93. (walk driver4 s9 p9-6)
   deleted: (at driver4 s9)
   added: (at driver4 p9-6)
   goals met: 19 of 23
94. (walk driver4 p9-6 s6)
   deleted: (at driver4 p9-6)
   added: (at driver4 s6)
   goals met: 20 of 23
95. (drive-truck driver5 s5 s9 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s9)
   goals met: 19 of 23
96. (drive-truck driver5 s9 s8 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   goals met: 19 of 23
97. (drive-truck driver1 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 18 of 23
98. (drive-truck driver5 s8 s9 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s9)
   goals met: 18 of 23
99. (drive-truck driver5 s9 s5 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s5)
   goals met: 19 of 23
100. (drive-truck driver1 s5 s9 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s9)
   goals met: 19 of 23
101. (disembark-truck driver1 s9 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s9) (empty truck3)
   goals met: 19 of 23
102. (board-truck driver1 s9 truck2)
   deleted: (at driver1 s9) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 19 of 23
103. (drive-truck driver5 s5 s9 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s9)
   goals met: 18 of 23
104. (drive-truck driver1 s9 s5 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s5)
   goals met: 18 of 23
105. (load-truck s5 package1 truck2)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   goals met: 18 of 23
106. (drive-truck driver1 s5 s6 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   goals met: 18 of 23
107. (drive-truck driver5 s9 s8 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   goals met: 18 of 23
108. (disembark-truck driver5 s8 truck4)
   deleted: (driving driver5 truck4)
   added: (at driver5 s8) (empty truck4)
   goals met: 19 of 23
109. (walk driver2 s0 p0-9)
   deleted: (at driver2 s0)
   added: (at driver2 p0-9)
   goals met: 18 of 23
110. (walk driver2 p0-9 s9)
   deleted: (at driver2 p0-9)
   added: (at driver2 s9)
   goals met: 18 of 23
111. (board-truck driver2 s9 truck3)
   deleted: (at driver2 s9) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 18 of 23
112. (drive-truck driver2 s9 s5 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s5)
   goals met: 18 of 23
113. (disembark-truck driver2 s5 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s5) (empty truck3)
   goals met: 18 of 23
114. (walk driver2 s5 p0-5)
   deleted: (at driver2 s5)
   added: (at driver2 p0-5)
   goals met: 18 of 23
115. (walk driver2 p0-5 s0)
   deleted: (at driver2 p0-5)
   added: (at driver2 s0)
   goals met: 19 of 23
116. (drive-truck driver1 s6 s5 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   goals met: 19 of 23
117. (disembark-truck driver1 s5 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 19 of 23
118. (board-truck driver1 s5 truck3)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 19 of 23
119. (unload-truck s5 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s5)
   goals met: 19 of 23
120. (board-truck driver5 s8 truck4)
   deleted: (at driver5 s8) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 18 of 23
121. (drive-truck driver5 s8 s9 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s9)
   goals met: 18 of 23
122. (drive-truck driver5 s9 s5 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s5)
   goals met: 19 of 23
123. (drive-truck driver1 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 20 of 23
124. (disembark-truck driver5 s5 truck4)
   deleted: (driving driver5 truck4)
   added: (at driver5 s5) (empty truck4)
   goals met: 20 of 23
125. (load-truck s5 package1 truck1)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 20 of 23
126. (board-truck driver5 s5 truck1)
   deleted: (at driver5 s5) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 20 of 23
127. (drive-truck driver5 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 20 of 23
128. (unload-truck s6 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s6)
   goals met: 21 of 23
129. (drive-truck driver5 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 21 of 23
130. (drive-truck driver5 s3 s8 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   goals met: 21 of 23
131. (disembark-truck driver5 s8 truck1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s8) (empty truck1)
   goals met: 22 of 23
132. (walk driver2 s0 p0-5)
   deleted: (at driver2 s0)
   added: (at driver2 p0-5)
   goals met: 21 of 23
133. (walk driver2 p0-5 s5)
   deleted: (at driver2 p0-5)
   added: (at driver2 s5)
   goals met: 21 of 23
134. (board-truck driver2 s5 truck2)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 21 of 23
135. (drive-truck driver2 s5 s9 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s9)
   goals met: 21 of 23
136. (drive-truck driver2 s9 s0 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s0)
   goals met: 22 of 23
137. (disembark-truck driver2 s0 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 23 of 23
